
/*-----------------------------------------------------------------------------
 *                          Embedded System SDK 2.00                          *
 *                               Copyright (c)                                *
 *                             2005-12-15 by Ken                              *
 *                               Beijing.China                                *
 *                            cpp.china@gmail.com                             *
 -----------------------------------------------------------------------------*/

#include <device.h>
#include <console.h>
#include <system.h>
#include <stdarg.h>
#include <stdio.h>

/* ------------------------------------------------------------------------
 *  函数名：
 *      char GetKey()
 *  功能：
 *      从终端读取一个按键
 *  参数：
 *      无
 *  返回值：
 *      按键的码
 *  说明：
 *      一直等待任意按键按下，没有光标显示
 * -----------------------------------------------------------------------*/

char GetKey()
{
	char key;

	// 等待按键
	while ((key = InKey()) == 0) {
		OSTimeDly(1);
	}
		
	return key;
}
